Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, MAYA'S WORLD.tmx
Source language: id
Languages: en

source: tapi kalo bantuin ngumpulin berkas adek mama bisa kok, buku tabungan kamu aman nak, tes TOEFL? visa udah dibikin?
en: but I think I can help manage your files. have you started your bank account? and how’s your TOEFL? have you applied for a visa?

source: GUA BALIK KE
en: I’ll be going home

source: Nanti kalo mama yang milih jadinya malah selera ibu-ibu!
en: I’m worried you won’t like what I pick out for you if I do.

source: KA-KALO
en: c-crap...

source: Tanpa saya.
en: ...before I let him go.

source: INI GUE BAWAIN KUE YA!!
en: here, I brought you guys some cake.

source: Dari pada dipanggil 'Kak' mending dipanggil 'sayang' gak sih, May?
en: how about calling you “baby” or “baby girl”?

source: Takut nggak enak, hehe…
en: what if it tastes terrible?

source: SOALNYA
en: she’s been working too hard

source: KALO KAMU
en: once you know

source: SOK DEH!!!
en: you weakling!

source: CUMA KURANG
en: it just

source: ini dimakan dulu ya, maya.
en: here you go.

source: HARUSNYA
en: if only maya

source: 'KAN DI SEKOLAH?
en: at school?

source: DIH?!
en: huh?!

source: Nggak, lo duluan aja, kayaknya lebih penting.
en: no... you can go first. I think your situation is more urgent.

source: nggak sebentar lho, hampir satu semester kamu nggak pernah bimbingan lagi.
en: you didn't show up for the entire semester.

source: SOAL
en: oh, and about

source: DIULANG.
en: to start over.

source: DAN RASAKAN
en: celebrate them

source: lha?!
en: what?!

source: SEBELUM KESOREAN,
en: I’ll see

source: BAHAS-BAHAS
en: we need to

source: KALAU
en: I guess

source: WAKTU
en: during

source: GUE MASIH PUNYA
en: I’m wasting my time

source: KITA CUMA FOTO SEKALI MAY TAPI…
en: we only took one picture, and I...

source: mama...
en: mom...

source: sekalipun
en: even talked

source: GUE NGGAK BUTUH BELAS KASIHAN.
en: I didn’t need him to take pity on me.

source: LU SEMUA MASIH
en: haven’t changed

source: HAHAHA… IYA… JADI NGGAK STRES BESOK KELAYAKAN…
en: hahaha, you bet! tomorrow’s test is gonna be no problem for me!

source: saya nggak egois...
en: ...I wasn’t so selfish...

source: Lagian bokap gue mana mau ngijinin gue berbisnis di luar bisnis keluarga, hahaha!
en: besides, there’s no way my dad would let me run my own business. hahaha!

source: Kamarnya sebelah sini yah!
en: her room is right here.

source: YA DULU
en: to me,

source: BENTROK, SAYA
en: to check

source: KALIAN ITU ANAK
en: are the members of

source: NGAPAIN SIH WEEKDAY KE BRAGA, NGAPA KAGAK WEEKEND AJA ORANG-ORANG
en: how come so many people are here when it’s not a holiday?

source: TAU?!
en: know my name?!

source: HAHAHA, OKE
en: okay, then.

source: Umm… Oke.
en: um... fine.

source: YANG BERKAITAN
en: who may have

source: SKRIPSI SEBELUMNYA,
en: previous thesis,

source: AYU...
en: sake.

source: Dia pasti juga ngijinin lo buat berbisnis 'kan?
en: had you done that, I’m sure your dad wouldn’t have had any problem giving you the money for your business, right?

source: Pasti datang
en: they’ll come,”

source: KENAPA JADI LO YANG REPOT GINI?
en: there’s no reason for you to worry about him.

source: udah kamu ngapain sih kayak saya abis kenapa aja...
en: calm yourself, girl. no need to cry. I’ll be okay...

source: Tukangnya masih lama, masih otw
en: the repairman is still on his way.

source: BETUL!
en: yup!

source: MAU DITARO
en: don’t know where to

source: DI SKRIPSI DIA YANG
en: relieved now

source: apaan sih?!! ini udah bagus kok?!!!
en: what the-?! how?! wasn’t this good enough?!

source: Mama harap ini jawaban yang jujur ya, nak.
en: I hope you’re being honest with me, maya.

source: Sebelum semuanya terjadi, sebelum gue dan lo tau perasaan masing-masing, gue cuma pengen balik ke masa itu lagi.
en: just like before everything happened... I just want to go back to that time when we didn’t know how we felt about each other.

source: BAHKAN SAMPAI
en: even my

source: Kenapa nggak bisa gue hubungin…?
en: why won’t he answer my calls?!

source: KABUR
en: eat

source: LO NGGAK ADA
en: like you

source: TEORI, BUKAN HAL
en: on the theory.

source: -KENANGAN!
en: a memento!

source: RADI KAMU TINGGI BANGET GAK KELIATAN
en: you don’t fit in the shot because you’re so tall.

source: EH IYA,
en: oh,

source: SIDANG?!
en: defense?!

source: sebaiknya lo balik duluan sebelum pengawal suruhan keluarga lo ngacak-ngacak rumah gue nyariin lo.
en: maybe you should go home right now. I don’t want your family’s lackeys to tear apart my house just to look for you.

source: GIMANA, SELAMA INI
en: we always thought

source: DULU!
en: catch!

source: KENAPA…?
en: why...?

source: bangunin aja, belom balik tu kayaknya dari kemaren.
en: I guess. seems like he hasn’t gone home since yesterday.

source: JADI BINGUNG
en: I guess we

source: Banyak pertanyaan… soal lo di kepala gue, Rad.
en: I have so many questions about you in my head.

source: KARENA SELAMA AKU NGGAK DI BANDUNG, AKU TETEP FOKUS SAMA TA-KU, SEMACAM TERUS MENCARI TAU GITU DEH.
en: while I was in bandung, my thesis and final project kept me occupied. and I was conducting research too.

source: SEMUANYA UDAH BERUBAH, AKU BUKAN LAGI ORANG YANG AKAN MENYELAMATKAN LARAS.
en: things have changed, and I’m no longer the guy she can always count on.

source: SAYA KETIDURAN?!!
en: I must’ve dozed off!

source: Oke, sesuai rencana, keluarga gue nggak bakal mengira gue bakal tinggal di sini karena yang mereka tau gue benci banget sama apartemen ini.
en: okay, everything is going according to plan. my family wouldn’t expect that I’d be living here. they thought that I hated it here.

source: SEKITAR
en: in

source: I-IYA...?!
en: y-yes...

source: semalem gak balik ke kontrakan, gue kira lo kabur anjir!
en: you didn’t come home last night. I thought you ran away!

source: Mencurigakan banget…
en: hmm... weird.

source: Sret-
en: hand

source: DI STUDIO,
en: gonna be held

source: SUKA BANGET SAMA
en: in her

source: SAMA DIA, TAPI MALAH
en: almost 4 years,

source: TAU GARA-GARA
en: is because

source: -pasangan kaku-
en: -awkward pose-

source: NGERASA
en: about him

source: CEERITAIN
en: you all

source: KOK...?
en: why are you-?

source: SAMPAI AKHIRNYA
en: eventually, I got accepted

source: GINI...
en: ugh...

source: IBU SAYA JUGA
en: myself from feeling

source: TAPI KALO SAMPAI MARAH DAN BENCI, SAYA RASA NGGAK MASUK AKAL.
en: but if you thought I despised you or was mad at you, you were totally wrong.

source: CUMA GUE NGGAK JAMIN BAKAL KETEMU ATAU NGGAK, TAPI GUE BAKAL BANTU LO SAMPE KETEMU.
en: well, I can’t promise we’ll find him, but I’ll help you look.

source: Ini sementara aja ya buk, soalnya saya benerinnya pake alat seadanya…
en: this is only a temporary fix, as I only used some scraps I had on hand.

source: Maya sekarang lagi ngurusin yang penting buat dirinya, dan itu juga penting buat gua.
en: maya is currently dealing with something important for herself. and it’s important for me too.

source: No Thanks, gue nggak bisa pake mobil murah.
en: hell no! I can’t drive a budget car like yours.

source: RADI KITA JADI
en: to radi, now we know

source: KE
en: japan,

source: Mama tuh kemaren liat ada wisudaan, pake atasan kayak baju bodo gitu, unik yaaa?
en: oh, I saw someone wearing a bodo blouse* at a commencement ceremony. it piqued me interest a lot.

source: udah kok ma, teh linda juga udah dikasih tau.
en: yeah, luckily. I’ve already told linda about it.

source: bukan berarti kamu harus masukin semuanya, nak.
en: that doesn’t mean you must put every single point in your thesis.

source: NIH MAKAN
en: here,

source: IKUT KELAS KERAMIK
en: the ceramic class

source: RADI?
en: about radi?

source: dari dulu aku percaya, perasaan akan bisa berubah kalo aku sama kamu terus barengan.
en: I thought that maybe if I stayed by your side, your feelings would change.

source: COCOK AJA
en: didn’t

source: GUE NGGAK PENGEN LO KETERUSAN BANTUIN GUE IKUT NYARI RADI, GUE PENGEN LO LEBIH FOKUS SAMA MASALAH LO, TERUTAMA SAMA BINTANG.
en: I don’t want you to keep helping me look for radi. Instead, I want you to worry about your own problems, especially with bintang.

source: IBU DATANG?
en: my son’s here?

source: BUKU SOAL SEJARAH PERFORMANCE ART…?
en: a book on the history of performing arts?

source: MASIH BANYAK
en: but there’s

source: PADA TAU KITA
en: that we’re

source: Oooh… Kalo gitu hari ini bisa nggak ke kampus dulu nggak nak?
en: I see... so, would it be okay if you take the day off?

source: besok pagi kamu tunggu aja kabar dari aku.
en: I’ll contact you first thing tomorrow morning.

source: BUKAN
en: I know

source: Maaf… gue nggak bermaksud buat ngulang kejadian yang sama…
en: sorry... I didn’t mean to repeat my mistake.

source: SIH SEBENERNYA
en: considered.

source: APA BUAT GUE
en: since we joined

source: KENAPA NGGAK BILANG UDAH BALIK DARI SURABAYA
en: why didn’t you tell me you returned from surabaya?

source: EMANG TELAT
en: held back

source: GUE TUH-
en: saying that...

source: lalu...kenapa
en: But then...

source: gapapa, masalah pacar, biasa.
en: I’m just having some relationship issues. no big deal.

source: UH...
en: um...

source: SENI MURNI
en: FINE ARTS

source: MALEMAN LAH
en: in bekasi

source: Gua tau yang gua lakuin itu salah, tapi apa penyelesaiannya harus kayak gini May?
en: I know I was wrong, but does it really have to end like this?

source: NGGAK APA-APA, SAYA EMANG MAU DATENG KARENA PENASARAN!
en: no worries, I’ll be there. I can’t wait to hear your thesis defense!

source: UDAH BISA
en: for your thesis

source: TAPI ASIK 'KAN AKU DAH LAMA NGGAK BIMBINGAN, 'SURPRIIISEEE!'
en: but I’m glad that I no longer have to meet with my advisor!

source: Kalo keburu gelap susah nyarinya.
en: come on, we need to find him before it gets dark.

source: Aduuh…
en: oh jeez...

source: MAU KASIH
en: you don’t

source: Saya pernah bilang sama kamu, saya nggak bisa menyertakan kamu buat terlibat sama masalah saya…
en: I’ve told you before that I don’t want you to get involved in my mess anymore.

source: TAPI KEMARIN MASBIN BIMBINGAN BARENG AKU TUH… UDAH PULANG DONG HARUSNYA?!
en: no, we met with our advisor yesterday, so he couldn’t be in surabaya right now!

source: NGADU KE GUA.
en: to report it to me.

source: IH DIMANA SIH JORDAN?!
en: where in the world is jordan?!

source: LAGI, YANG
en: talk about it anymore.

source: Maya seneng sama kuliah keramik?
en: did you like it?

source: MAMA BISA
en: could

source: Emangnya nggak bisa minta baik-baik ke bokap lo gitu?
en: you should’ve discussed it with your dad first.

source: KAYAK GITU.
en: mean to--

source: BOLEH!
en: sure!

source: NANTI KAMU BAWA KARYA KAMU GIMANA?
en: how are you gonna bring your artwork?!

source: Ditelpon juga nggak diangkat…
en: he’s also not answering his phone.

source: SEMAKIN
en: I guess

source: TEMPAT...
en: to start looking...

source: DHEG!
en: bam

source: kepada penumpang
en: of the argo parahyangan,

source: RADI TUH TERTUTUP
en: he’s pretty reserved,

source: MEMAHAMI
en: understand maya,

source: NG-NGGAK, APA SIH GUE SUMA MAU NGAJAK NGOBROL.
en: n-nothing, I just wanted to chat...

source: NGGA BISA, SOALNYA
en: my schedule first.

source: Saya juga sayang banget sama Radi…
en: I love you too, radi.

source: Kasih gua alesan apapun, sepahit apapun, gua nggak peduli.
en: Just give me an explanation, no matter how painful it would be.

source: Kuliahnya juga kebanyakan praktek ma…
en: during the course, we’d practice making pottery too.

source: CERITA KE
en: I overheard him

source: HAHH....
en: ugh...

source: TAPI AKU...
en: but...

source: SUMBER
en: a source of

source: Apa yang terjadi kalo Radi masih ikut ngurusin masalah saya?
en: I wonder what will happen if you continue to get involved in my mess.

source: terdapat pendirian yang kuat... bagai beton...
en: lies a strong and independent individual.

source: tapi nyatanya... aku malah menghambat kamu...
en: turns out... I’m just a hurdle for you.

source: MENJENGUK
en: a visit,

source: AJA CARANYA!
en: the procedure!

source: MENGEJARNYA.
en: and how to achieve them.

source: MAYAAA!!!
en: maya!

source: Berisik!!!
en: shut up!

source: HMM… AKU NGGAK TAU HARUS MULAI DARI MANA…
en: I just don’t know where to start.

source: intinya malah jauh dari isi skripsi kamu.
en: the conclution deviates significantly from the analysis.

source: NIH, GUE BAWAIN ROTI.
en: here, I brought you some bread.

source: RADI SINI, SINI.
en: radi, move over here.

source: episode 60 Mengambil risiko
en: episode 60 take a risk

source: PIKIR GAK PERLU
en: we could just

source: Boleh, minta tolong apa?
en: sure. what do you need?

source: DATENG SENDIRIAN
en: who stood up to pedal was me.

source: KAMU NGGAK BURU-BURU PULANG 'KAN?
en: you’re not going home anytime soon, right?

source: SETELAH NGOBROL
en: after she finished

source: KITTY, BIKIN
en: kitty.

source: nggak, gua nyariin lu.
en: no, I’m here to see you.

source: AGAK BANDEL,
en: a bit stubborn,

source: RAS, GUE KE SANA DULU BENTAR.
en: laras, I’m going to head out for a bit.

source: Mama bisa bantu lho, tapi jangan bilang-bilang Linda ya hahaha
en: look, I can lend you hand, but don’t tell linda, okay? hahaha!

source: APAKAH KITA AKAN TERUS-TERUSAN MEMBIARKAN DIRI KITA ‘KOSONG’?
en: will we keep allowing ourselves to be drawn into the void?

source: NAMA KITA
en: our reputation!

source: BELOM BALIK
en: since

source: TAU PASTINYA
en: what they were

source: SAYA PULANG.
en: I’m going home.

source: MULAI MEMPERLIHATKAN AMBISINYA, DAN SIBUK
en: they started to think about their dreams

source: Gua cuma nggak suka aja May kejebak dalem ke-nggakjelas-an kayak gini… diem-dieman, apalah…
en: I just don’t want to be stuck in this uncertainty any longer. the lingering silence between us has been killing me.

source: NGAJAKIN MAYA
en: planning to ask her

source: episode 64 Dan Sebuah Hutang Budi
en: episode 64 a favor

source: minta dibubut ye komuknya
en: you want me to smash your face in?!

source: SIAPA SIH MALAM-MALAM GINI…?!
en: who’s coming at this hour?

source: KETIKA KAMU
en: since you had

source: PENGEN KAMU
en: and provoke your curiosity?

source: KERJAAN BANGET
en: why would someone

source: TADI...
en: here...

source: SEJAK KEJADIAN
en: since then,

source: ngomong -ngomong, saya harus ke perpus...
en: anyway, I need to go to the library.

source: SEMPET
en: this

source: GUA WAKTU.
en: time.

source: KEBERATAN,
en: do me one last favor?

source: CK!!
en: tsk!

source: GUE… GAK TAU MAU NYARI RADI KEMANA LAGI…
en: I don’t know where to find radi.

source: GUE BILANG
en: I told you

source: THANKS.
en: okay, thanks.

source: BUKANNYA MAKSUD
en: I’m

source: YANG CURHAT...
en: like that.

source: AKU KIRA KAMU BAKAL MARAH SAMA AKU, KARENA TAHU SOAL INTERNSHIP RADI, AKU PENGEN MINTA MAAF…
en: I thought you would be angry with me because I knew about radi’s internship and all... so, I’m really sorry--

source: SURVEY?
en: a field observation?

source: puanas e koyok ngene...
en: so hot...

source: DIA KECAPEAN
en: she’s

source: Oh Radi, iya gue cuti dulu nih, hahaha ada apa?
en: oh, radi... I’m taking the semester off. what’s up?

source: DEMAMNYA
en: lasts longer

source: WALAUPUN MEREKA BILANG INI BUKAN
en: even though they said

source: Iya!
en: yup!

source: gua harus ngapain dah ini.
en: what should I do?

source: ibu dulu juga dosen wali kamu, maya... ibu selalu memantau perkembangan kamu...
en: I also served as your academic advisor. I’ve always kept tabs on your development.

source: AYU PENGEN MAMA
en: I just want you

source: TEMPAT BUAT
en: a place for

source: eh maaf... lagi baca chat...
en: oh, sorry... I was checking my phone.

source: MENYADARI INI MEMBUAT SAYA NGGAK BISA NGAPA-NGAPAIN, TERLALU BANYAK MASALAH YANG DATENG SEHINGGA SAYA TIDAK BISA MENGENDALIKAN DIRI SAYA SENDIRI.
en: when I realized this, I felt like I couldn’t do anything. that I couldn’t handle all the problems that were coming my way.

source: Lo nggak mau cobain macaroon murah ini?
en: why don’t you have a taste of it?

source: NGEJAR KELAYAKAN
en: because of all the tests

source: Uhm… Belom Ma, katanya saya harus ganti dosbing…
en: umm... no, mom. I have to switch advisors first.

source: NANTI SAYA NGGAK BISA MASUK KOSAN LAGI!!!
en: I don’t wanna be locked out of the lodge.

source: NYOBAIN CARA
en: try this

source: Ada part yang agak longgar deket cantolannya, jadi dibuka ama ditutupnya kudu pelan-pelan.
en: there were some loose parts around the hinges, so you should open and close the door gently.

source: Eeeh!
en: huh?!

source: DARITADI?!!
en: you!!!

source: LESU BENER
en: out of

source: SELASA
en: next

source: Um… Permisi, ini betul dengan rumah Laras?
en: um... excuse me, is this laras’s house?

source: HUTANG BUDI SAMA
en: to someone

source: kalau saja saya beranggapan yang buruk-buruk, nggak selalu buruk buat saya...
en: if only I had realized that bad things don’t necessarily mean bad things...

source: JELEK, HAHAHA.
en: hahaha!

source: iyaa sebentar!
en: coming!

source: OOOH…
en: ah, I see...

source: lha trus piye iki? lak mateng aku lek tidur kamarku dewe...
en: what should I do now? I’m gonna be burned to a crisp if I stay here.

source: Duuuh kayak orang susah deh!!!
en: damn it, laras! why are you like this?!

source: Sisanya?
en: but beyond that,

source: KARENA KEJADIAN YANG LALU ITU…
en: you know, about what happened last time...

source: INI NGGAK MUNGKIN
en: a simple fall wouldn’t have resulted

source: INI DIA!!
en: there she is!

source: SEMUANYA MEMANG TERDENGAR SEMPURNA TAPI SEBENARNYA ITU JEBAKAN.
en: it appears to be an ideal situation... but it is in fact a trap.

source: iya, tadi dia nitip banyak banget ke saya, katanya neng ayu harus sering inget-inget makan.
en: that’s what he said. he asked me to look after you, and he wouldn’t want you to skip meals.

source: MASA HARUS GUE SAMPER KE SURABAYA SIH…?
en: do I really need to catch up with him in surabaya?

source: PENELITIAN
en: let me ask you this.

source: OKE, SAYA CEK LAGI YA.
en: don’t worry, I’ll double-check.

source: KALO BOLEH,
en: I’d love to come

source: NYARI RADI...
en: find Radi.

source: gua masih butuh kejelasan dari maya, tapi gua harus cari dia kemana?
en: I still need some explanation from maya, but where can I find her?

source: Cklek
en: clack

source: DIEM-DIEM
en: but he just

source: MA- MAYA…?!!
en: m-maya?!

source: KEPIKIRAN KARENA
en: I was

source: YAH… IYA SIH, TAPI DIA NGGAK BISA GUE HUBUNGIN SAMA SEKALI, CHAT GUE BAHKAN GAK DI READ…
en: well, you’re right, but I couldn’t get in touch with him at all. he hasn’t even read my texts.

source: HHH… YA UDAHG, TRUS INI KAMU MAU NGAPAIN TIBA-TIBA MANJA BEGINI.
en: huff... okay, so why are you suddenly acting so lovey-dovey?

source: GAK TAU APA-APA
en: know nothing

source: Lo selalu mengabaikan gue setiap mau mencairkan suasana sama lo…
en: You’ve always ignored me whenever I try to break the ice.

source: Saya juga bilang ke kamu 'kan mama saya kecewa sama saya karena saya nggak ngerjain skripsi saya.
en: I’ve also told you that my mother has been very disappointed in me for abandoning my thesis.

source: AYO CEPET ITU TIMERNYA JALAN TERUS!!
en: the timer keeps going, so let’s hurry!

source: SEBAIKNYA DI SKRIPSI
en: it would be much better

source: ANAK ITU...
en: that girl...

source: KENAPA SIH?
en: with your friend?

source: GINI NGGAK
en: wouldn’t have

source: GUE NGUPING,
en: about it,

source: KENAPA DIA HENING BANGET YA…?
en: why is he so quiet?

source: kita gak bakal wisuda bareng tau nggak?!!!!
en: we can’t graduate together at this rate, you know?!

source: kereta api argo
en: argo parahyangan

source: GUE NGGAK MAU KETAUAN SERING-SERING KE RUMAH LO, KITTY UDAH DIMANA-MANA.
en: I don’t want Kitty to find out that I come to your house often. you see, now he’s everywhere.

source: TAKUT MALAH
en: she panicked because

source: Kak Ais ngomong apa sama mama soal saya…?
en: what did harist tell mom about me?

source: …SIAL… GUE KEBAWA EMOSI… APA URUSAN GUE JUGA SIH…
en: shoot... I got carried away. it’s not my business anyway...

source: Uhh… Kuro-chan don't be like this… I need you…
en: ugh... kuro-chan, please don’t be like this! I need you!

source: OMG… This is so good?!
en: wow... it’s so good!

source: SAYA HARAP SAYA BARUSAN JUGA NGGAK TERLALU SOK TAU…
en: and I hope I didn’t say anything that I shouldn’t have...

source: BUK!
en: kick

source: Tentuin sekarang May, lu mau udahan?
en: make your decision now, maya.

source: YANG BIKIN KAMU
en: what is the thing

source: Maen dateng-dateng aja?!
en: you should’ve called me before you got here!

source: JAMES Segera
en: James helped the chick

source: KATANYA MAU SIMULASI SIDANG?!!
en: you said you wanted to simulate your thesis defense!

source: RADI DEH, TAPI
en: perhaps

source: KENAPA SAYA MALAH TAUNYA DARI KAMU?
en: I was surprised to learn about it from you...

source: MANA GUE NGGAK PERNAH LIAT MAYA KAYAK GINI SEBELUMNYA…
en: I’ve never seen her like this before.

source: Lha kamu masih bisa kepikiran sama TA-ku?
en: huh? my final project shouldn’t be your concern.

source: MAMA KALAU
en: to focus

source: tapi itu sebenernya kehendak dari diri kita sendiri.
en: but now I realize that I can’t change that.

source: CARA DIA NGEHANDLE
en: how he managed

source: semua masalah di sini belom kelar, udah disuruh pulang.
en: there are still so many things I need to take care of. I can’t go home now.

source: MUNGKIN ITU SALAH SATU CARA BIAR MAMA MEMAHAMI MAYA…
en: she might be trying to get to know you in that way.

source: Lo sendiri tau keluarga lo bukan orang sembarangan…
en: you know what your family is capable of.

source: PUNYA DORONGAN
en: personal drive

source: BRRT|
en: bzzt

source: SKRIPSI?
en: thesis?

source: yol, dp 4 lo dah beres?
en: hey, have you finished the fourth product design?

source: BARU SAMPE TADI PAGI.
en: well, I just got here this morning.

source: episode 65 Saya Tidak Ingin Kalut Sendiri
en: episode 65 quarrel with my own thoughts

source: CERITA APA
en: to talk

source: TAU MAYA
en: want to tell

source: INI SEBENERNYA
en: the one who started

source: NGGAK PADA
en: about this

source: SKRIPSI
en: that

source: JUGA PENGEN
en: want to

source: MAU KEMAA SIH?!!
en: where are you going?!

source: Eh?!
en: huh?!

source: GUE, LUCU
en: hahaha...

source: Saya nggak bisa bayangin…
en: I don’t even want to imagine it.

source: Gue juga pengen benerin semuanya, termasuk hubungan lo dan Maya…
en: I want to fix everything, including your relationship with maya.

source: aku cuma sekali ini ya nolongin kamu, aku harap kamu nggak memperburuk keadaan.
en: I’m only gonna help you this one time, okay? I hope you don't make things worse.

source: Maya penting 'kan buat lo…?
en: she’s important to you, right?

source: MASIH SAKIT?
en: she now?

source: DONG?!
en: like, seriously?!

source: DITARIK KE HALAMAN
en: dragged me

source: STUDIO.
en: the studio.

source: Ngapain basah kuyup kayak gini?!!!
en: you’re soaking wet!

source: GUE TUMBUH BESAR
en: since then...

source: MAU SIDANG?
en: is just around the corner.

source: HEHE
en: hahaha!

source: Sekalian gua bawain macaroon murah nih!
en: oh, and I’ve brought you some macarons. the cheap ones, of course!

source: KITA COBAIN LAGI YA, ABIS INI SOAL PROSES BERKARYA.
en: we’ll try again later. now, let’s move on to the process of making art.

source: CUMA GUE TUH,
en: where were

source: KELAS, GUA BAKAL
en: I’ll be the one to report this

source: DAN UDAH BIKIN
en: for ruining

source: DEKET-DEKET
en: that is convenient

source: MEMBUTUHKAN
en: how long

source: YA GIMANA YA...
en: and a mother,

source: PAKAI CARA LAMA.
en: this time around.

source: Udah ye, abis ini lu kasih tau Bintang soal gua sama lu.
en: well, make sure you tell bintang about us after this, okay?
